Aritmetic Operation

In [3]:
import pandas as pd

var = pd.DataFrame({
        "a":[1,2,3,4,5],
        "b":[3,5,6,3,2]
        })

var

   a  b
0  1  3
1  2  5
2  3  6
3  4  3
4  5  2

In [4]:
import pandas as pd

var = pd.DataFrame({
        "a":[1,2,3,4,5],
        "b":[3,5,6,3,2]
        })

var

var["c"] = var["a"] + var["b"]

var

   a  b  c
0  1  3  4
1  2  5  7
2  3  6  9
3  4  3  7
4  5  2  7

In [6]:
var["c"] = var["a"] - var["b"]

var

   a  b  c
0  1  3 -2
1  2  5 -3
2  3  6 -3
3  4  3  1
4  5  2  3

In [7]:
var["c"] = var["a"] * var["b"]

var

   a  b   c
0  1  3   3
1  2  5  10
2  3  6  18
3  4  3  12
4  5  2  10

other operations

In [14]:
var1 = pd.DataFrame({
        "a":[10,20,30,40,50],
        "b":[35,75,66,83,42]
        })

var1["Python"] = var1["b"] <=70
var1["java"] = var1["a"] >=30

var1

    a   b  Python   java
0  10  35    True  False
1  20  75   False  False
2  30  66    True   True
3  40  83   False   True
4  50  42    True   True